In [1]:
# импортируем библиотеки pandas и numpy
import pandas as pd
import numpy as np

In [2]:
# создаем датафрейм
df = pd.DataFrame({'Empl': [10, 20], 
                   'Age': [30, 40]})
df

   Empl  Age
0    10   30
1    20   40

In [3]:
# вычисляем среднее по строкам
df.mean(axis=0)

Empl    15.0
Age     35.0
dtype: float64

In [4]:
# вычисляем среднее по столбцам
df.mean(axis=1)

0    20.0
1    30.0
dtype: float64

In [5]:
# смотрим версию
pd.__version__

'1.4.2'

In [6]:
# создаем серию целочисленных значений
s_int = pd.Series([10, 35, 130]) 
s_int

0     10
1     35
2    130
dtype: int64

In [7]:
# выводим диапазон чисел для типа int64
np.iinfo('int64')

iinfo(min=-9223372036854775808, max=9223372036854775807, dtype=int64)

In [8]:
# выводим диапазон чисел для типа int8
np.iinfo('int8')

iinfo(min=-128, max=127, dtype=int8)

In [9]:
# сменим тип на int8
s_int.astype('int8')

0     10
1     35
2   -126
dtype: int8

In [10]:
# сменим тип на uint8
s_int.astype('uint8')

0     10
1     35
2    130
dtype: uint8

In [11]:
# выводим диапазон чисел для типа uint8
np.iinfo('uint8')

iinfo(min=0, max=255, dtype=uint8)

In [12]:
# создаем серию типа int64
pd.Series([10, 35, 130, np.nan], dtype='int64')

ValueError: cannot convert float NaN to integer

In [13]:
# серии с пропусками будет присвоен тип float64
pd.Series([10, 35, 130, np.nan])

0     10.0
1     35.0
2    130.0
3      NaN
dtype: float64

In [14]:
# создаем серию с типом nullable integer (Int64)
s_nullable_int = pd.Series([10, 35, 130, np.nan], 
                           dtype='Int64')
s_nullable_int

0      10
1      35
2     130
3    <NA>
dtype: Int64

In [15]:
# создаем серию с типом nullable integer (Int64)
pd.Series([10, 35, 130, pd.NA], dtype='Int64')

0      10
1      35
2     130
3    <NA>
dtype: Int64

In [16]:
# создаем серию с типом nullable integer (Int8)
pd.Series([10, 35, 130], dtype='Int8')

TypeError: cannot safely cast non-equivalent int64 to int8

In [17]:
# создаем серию с типом nullable unsigned integer (UInt8)
pd.Series([10, 35, 130, pd.NA], dtype='UInt8')

0      10
1      35
2     130
3    <NA>
dtype: UInt8

In [18]:
# создаем серию с типом float64
s_float = pd.Series([5.26, 1234.56789, np.nan])
s_float

0       5.26000
1    1234.56789
2           NaN
dtype: float64

In [19]:
# присвоим тип float32
s_float.astype('float32')

0       5.260000
1    1234.567871
2            NaN
dtype: float32

In [20]:
# выведем диапазон чисел и точность для типа float32
np.finfo('float32')

finfo(resolution=1e-06, min=-3.4028235e+38, max=3.4028235e+38, dtype=float32)

In [21]:
# выведем диапазон чисел и точность для типа float16
np.finfo('float16')

finfo(resolution=0.001, min=-6.55040e+04, max=6.55040e+04, dtype=float16)

In [22]:
# присвоим тип float16
s_float.astype('float16')

0       5.261719
1    1235.000000
2            NaN
dtype: float16

In [23]:
# переведем из float64 в int64
s_float.astype('int64')

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [24]:
# удалим пропуски и переведем из float в int
s_float.dropna().astype('int64')

0       5
1    1234
dtype: int64

In [25]:
# присвоим тип nullable integer (Int64)
s_float.astype('Int64')

TypeError: cannot safely cast non-equivalent float64 to int64

In [26]:
# округлим и присвоим тип nullable integer (Int64)
s_float.round(0).astype('Int64')

0       5
1    1235
2    <NA>
dtype: Int64

In [27]:
# преобразовываем из типа int64 в тип float64
s_int.astype('float64')

0     10.0
1     35.0
2    130.0
dtype: float64

In [28]:
# преобразовываем из типа nullable integer (Int64)
# в тип float64
s_nullable_int.astype('float64')

0     10.0
1     35.0
2    130.0
3      NaN
dtype: float64

In [29]:
# преобразовываем из типа float 
# в тип nullable float (Float64)
nullable_float = s_float.astype('Float64')
nullable_float

0          5.26
1    1234.56789
2          <NA>
dtype: Float64

In [30]:
# создадим серию логических значений
s_bool = pd.Series([True, False]) 
s_bool

0     True
1    False
dtype: bool

In [31]:
# создаем серию с типом integer
s = pd.Series([0, 1, 59, -35])

In [32]:
# преобразовываем в тип boolean
s.astype('bool')

0    False
1     True
2     True
3     True
dtype: bool

In [33]:
# создаем серию с типом float
s = pd.Series([0, 0.0001, -3.99])

In [34]:
# преобразовываем в тип boolean
s.astype('bool')

0    False
1     True
2     True
dtype: bool

In [35]:
# преобразуем из типа boolean в тип integer
s_bool.astype('int64')

0    1
1    0
dtype: int64

In [36]:
# создаем серию с типом boolean
s = pd.Series([True, False, np.nan], dtype='bool')
s

0     True
1    False
2     True
dtype: bool

In [37]:
# присвоение значения nan одному из логических
#  значений дает серию с типом object
s.loc[0] = np.nan
s

0      NaN
1    False
2     True
dtype: object

In [38]:
# создаем серию с типом nullable boolean
s = pd.Series([True, False, np.nan], dtype='boolean') 
s

0     True
1    False
2     <NA>
dtype: boolean

In [39]:
# создаем серию с типом integer
s = pd.Series([-15, 45])
s

0   -15
1    45
dtype: int64

In [40]:
# выполняем деление, получаем
# серию с типом float
s / 15

0   -1.0
1    3.0
dtype: float64

In [41]:
# используем деление с округлением 
# до целого значения вниз
s // 77

0   -1
1    0
dtype: int64

In [42]:
# выполняем умножение
s * 4.4

0    -66.0
1    198.0
dtype: float64

In [43]:
# задаем тип int8 так
pd.Series([10, 50]).astype(np.int8)

0    10
1    50
dtype: int8

In [44]:
# а еще можно так
pd.Series([10, 50]).astype('int8')

0    10
1    50
dtype: int8

In [45]:
# создаем серию с типом nullable integer (Int32)
pd.Series([10, 50, np.nan]).astype(pd.Int32Dtype())

0      10
1      50
2    <NA>
dtype: Int32

In [46]:
# создаем серию с типом nullable float (Float64)
pd.Series([7.3, 5.8, np.nan], dtype=pd.Float64Dtype())

0     7.3
1     5.8
2    <NA>
dtype: Float64

In [47]:
# создаем серию со строковыми значениями
s_object = pd.Series(['some', 'strings']) 
s_object

0       some
1    strings
dtype: object

In [48]:
# проверим тип
s_object.dtype

dtype('O')

In [49]:
# присвоим серии с целыми числами тип object
s = pd.Series([5, 10])
s.astype('object')

0     5
1    10
dtype: object

In [50]:
# значения по прежнему целые числа 
type(s.loc[0])

numpy.int64

In [51]:
# серия с типом object может содержать все что угодно
garbage_series = pd.Series([[1,2], True, 'some string', 
                            4.5, {'key': 'value'}])
garbage_series

0              [1, 2]
1                True
2         some string
3                 4.5
4    {'key': 'value'}
dtype: object

In [52]:
# элементом серии с типом object
# может быть все что угодно
print(type(garbage_series.loc[0]))
print(type(garbage_series.loc[1]))
print(type(garbage_series.loc[2]))
print(type(garbage_series.loc[3]))
print(type(garbage_series.loc[4]))

<class 'list'>
<class 'bool'>
<class 'str'>
<class 'float'>
<class 'dict'>

In [53]:
# записываем CSV-файл в объект DataFrame
credit = pd.read_csv('Data/credit_train.csv', 
                     encoding='cp1251', 
                     decimal=',', 
                     sep=';')
# выводим первые 5 наблюдений датафрейма
credit.head()

,client_id,gender,age,marital_status,job_position,credit_sum,credit_month,tariff_id,score_shk,education,living_region,monthly_income,credit_count,overdue_credit_count,open_account_flg
0,1,M,NaN,NaN,UMN,59998.00,10,1.6,NaN,GRD,КРАСНОДАРСКИЙ КРАЙ,30000.0,1.0,1.0,0
1,2,F,NaN,MAR,UMN,10889.00,6,1.1,NaN,NaN,МОСКВА,NaN,2.0,0.0,0
2,3,M,32.0,MAR,SPC,10728.00,12,1.1,NaN,NaN,ОБЛ САРАТОВСКАЯ,NaN,5.0,0.0,0
3,4,F,27.0,NaN,SPC,12009.09,12,1.1,NaN,NaN,ОБЛ ВОЛГОГРАДСКАЯ,NaN,2.0,0.0,0
4,5,M,45.0,NaN,SPC,NaN,10,1.1,0.421385,SCH,ЧЕЛЯБИНСКАЯ ОБЛАСТЬ,NaN,1.0,0.0,0

In [54]:
# смотрим частоты категорий job_position
job_position = credit['job_position']
job_position.value_counts()

SPC    134680
UMN     17674
BIS      5591
PNA      4107
DIR      3750
ATP      2791
WRK       656
NOR       537
WOI       352
INP       241
BIU       126
WRP       110
PNI        65
PNV        40
PNS        12
HSK         8
INV         5
ONB         1
Name: job_position, dtype: int64

In [55]:
# присваиваем тип Categorical
job_position_cat = job_position.astype('category')
job_position_cat.head()

0    UMN
1    UMN
2    SPC
3    SPC
4    SPC
Name: job_position, dtype: category
Categories (18, object): ['ATP', 'BIS', 'BIU', 'DIR', ..., 'UMN', 'WOI', 'WRK', 'WRP']

In [56]:
# смотрим тип серии
job_position_cat.dtype

CategoricalDtype(categories=['ATP', 'BIS', 'BIU', 'DIR', 'HSK', 'INP', 'INV', 'NOR',
                  'ONB', 'PNA', 'PNI', 'PNS', 'PNV', 'SPC', 'UMN', 'WOI',
                  'WRK', 'WRP'],
, ordered=False)

In [57]:
# создаем 2 списка
cats = ['Python', 'Java', 'Scala']
vals = [1, 1, 0, 2, 0, 1, 2, 2, 1, 2, 1]

In [58]:
# выполняем сопоставление
[cats[val] for val in vals]

['Java',
 'Java',
 'Python',
 'Scala',
 'Python',
 'Java',
 'Scala',
 'Scala',
 'Java',
 'Scala',
 'Java']

In [59]:
# выведем уникальный список категорий
job_position_cat.cat.categories

Index(['ATP', 'BIS', 'BIU', 'DIR', 'HSK', 'INP', 'INV', 'NOR', 'ONB', 'PNA',
       'PNI', 'PNS', 'PNV', 'SPC', 'UMN', 'WOI', 'WRK', 'WRP'],
      dtype='object')

In [60]:
# смотрим целочисленные коды
job_position_cat.cat.codes.head()

0    14
1    14
2    13
3    13
4    13
dtype: int8

In [61]:
# объем памяти для хранения серии типа object
orig_mem = job_position.memory_usage(deep=True) 
orig_mem

10244888

In [62]:
# объем памяти для хранения серии типа Categorical
cat_mem = job_position_cat.memory_usage(deep=True) 
cat_mem

172510

In [63]:
# выполним операцию приравнивания 
# для серии типа object
%timeit -n 5 -r 2 job_position == 'SPC'

8.95 ms ± 191 µs per loop (mean ± std. dev. of 2 runs, 5 loops each)

In [64]:
# выполним операцию приравнивания
# для серии типа Categorical
%timeit -n 5 -r 2 job_position_cat == 'SPC'

104 µs ± 18 µs per loop (mean ± std. dev. of 2 runs, 5 loops each)

In [65]:
# присвоим серии с целочисленными значениями тип Categorical
credit_month_cat = credit['credit_month'].astype('category')
credit_month_cat.head(10)

0    10
1     6
2    12
3    12
4    10
5    10
6     6
7    10
8    12
9    10
Name: credit_month, dtype: category
Categories (31, int64): [3, 4, 5, 6, ..., 30, 31, 32, 36]

In [66]:
# создаем серию с типом string
s_string = pd.Series(['Python', 'Java', 'Scala', pd.NA], 
                     dtype='string')
s_string

0    Python
1      Java
2     Scala
3      <NA>
dtype: string

In [67]:
# создаем серию с типом string
s_string = pd.Series(['Python', 'Java', 'Scala', pd.NA], 
                     dtype=pd.StringDtype())
s_string

0    Python
1      Java
2     Scala
3      <NA>
dtype: string

In [68]:
# серия с типом string может содержать только строки и пропуски
garbage_series = pd.Series([[1,2], True, 'some string', 4.5, 
                            {'key': 'value'}])
garbage_series = garbage_series.astype('string')
# значения уже будут строками 
print(type(garbage_series.loc[0]))
print(type(garbage_series.loc[1]))
print(type(garbage_series.loc[2]))
print(type(garbage_series.loc[3]))
print(type(garbage_series.loc[4]))

<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>

In [69]:
# сделаем буквы заглавными
s_string.str.upper()

0    PYTHON
1      JAVA
2     SCALA
3      <NA>
dtype: string

In [70]:
# создаем серию со строками, выглядящими как числа
s = pd.Series(['4.5', '3.19'])
s

0     4.5
1    3.19
dtype: object

In [71]:
# переводим в тип float64
s.astype('float64')

0    4.50
1    3.19
dtype: float64

In [72]:
# создаем серию со строковыми значениями
s = pd.Series(['4.5', '3.19', 'NO ANSWER'])
s

0          4.5
1         3.19
2    NO ANSWER
dtype: object

In [73]:
# переводим в тип float64
s.astype('float64')

ValueError: could not convert string to float: 'NO ANSWER'

In [74]:
# выполняем преобразование в тип float64
pd.to_numeric(s, errors='coerce')

0    4.50
1    3.19
2     NaN
dtype: float64

In [75]:
# серии с целыми числами присваиваем тип object
# с помощь строкового значения str
s = pd.Series([10, 20, 99])
s.astype('str')

0    10
1    20
2    99
dtype: object

In [76]:
# проверим, являются ли наши значения строками
s.astype('str').values

array(['10', '20', '99'], dtype=object)

In [77]:
# преобразовываем в тип string
s.astype('string')

0    10
1    20
2    99
dtype: string

In [78]:
# загружаем ежемесячные данные 
# о продажах автомобилей
cars = pd.read_csv('Data/monthly_car_sales.csv', 
                   header=0, 
                   index_col=0, 
                   squeeze=True,
                   parse_dates=True)
cars.head()

/var/folders/x9/w1kvj6ms0p52l8j6crt19vmh0000gn/T/ipykernel_53210/827463633.py:3: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  cars = pd.read_csv('Data/monthly_car_sales.csv',

Month
1960-01-01     6550
1960-02-01     8728
1960-03-01    12026
1960-04-01    14395
1960-05-01    14587
Name: Sales, dtype: int64

In [79]:
# загружаем ежемесячные данные 
# о продажах автомобилей
cars = pd.read_csv('Data/monthly_car_sales.csv', 
                   header=0, 
                   index_col=0, 
                   parse_dates=True).squeeze('columns')
cars.head()

Month
1960-01-01     6550
1960-02-01     8728
1960-03-01    12026
1960-04-01    14395
1960-05-01    14587
Name: Sales, dtype: int64

In [80]:
# загружаем данные
bikes = pd.read_csv('Data/bikes.csv')
bikes.head(3)

,gender,starttime,stoptime,tripduration,from_station_name,start_capacity,to_station_name,end_capacity,temperature,wind_speed,events
0,Male,2013-06-28 19:01:00,2013-06-28 19:17:00,993,Lake Shore Dr & Monroe St,11.0,Michigan Ave & Oak St,15.0,73.9,12.7,mostlycloudy
1,Male,2013-06-28 22:53:00,2013-06-28 23:03:00,623,Clinton St & Washington Blvd,31.0,Wells St & Walton St,19.0,69.1,6.9,partlycloudy
2,Male,2013-06-30 14:43:00,2013-06-30 15:01:00,1040,Sheffield Ave & Kingsbury St,15.0,Dearborn St & Monroe St,23.0,73.0,16.1,mostlycloudy

In [81]:
# смотрим количество наблюдений
# и количество переменных
print(bikes.shape)

(50089, 11)

In [82]:
# смотрим количество наблюдений
print(len(bikes))

50089

In [83]:
# смотрим типы данных
bikes.dtypes

gender                object
starttime             object
stoptime              object
tripduration           int64
from_station_name     object
start_capacity       float64
to_station_name       object
end_capacity         float64
temperature          float64
wind_speed           float64
events                object
dtype: object

In [84]:
# заново читаем данные, парсим даты
bikes = pd.read_csv('Data/bikes.csv', 
                    parse_dates=['starttime', 'stoptime'])
bikes.dtypes.head()

gender                       object
starttime            datetime64[ns]
stoptime             datetime64[ns]
tripduration                  int64
from_station_name            object
dtype: object

In [85]:
# выведем информацию о типе данных и количестве 
# непропущенных наблюдений для каждой переменной
bikes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50089 entries, 0 to 50088
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   gender             50089 non-null  object
 1   starttime          50089 non-null  datetime64[ns]
 2   stoptime           50089 non-null  datetime64[ns]
 3   tripduration       50089 non-null  int64
 4   from_station_name  50089 non-null  object
 5   start_capacity     50083 non-null  float64
 6   to_station_name    50089 non-null  object
 7   end_capacity       50077 non-null  float64
 8   temperature        50089 non-null  float64
 9   wind_speed         50089 non-null  float64
 10  events             50089 non-null  object
dtypes: datetime64[ns](2), float64(4), int64(1), object(4)
memory usage: 4.2+ MB

In [86]:
# выведем имена столбцов
print(bikes.columns.tolist())

['gender', 'starttime', 'stoptime', 'tripduration', 'from_station_name', 'start_capacity', 'to_station_name', 'end_capacity', 'temperature', 'wind_speed', 'events']

In [87]:
# максимальное количество столбцов
pd.get_option('display.max_columns')

20

In [88]:
# максимальное количество столбцов
pd.get_option('display.max_rows')

60

In [89]:
# максимальная ширина столбца
pd.get_option('display.max_colwidth')

50

In [90]:
# задаем новые настройки
pd.set_option('display.max_columns', 30, 
              'display.max_rows', 100)

In [91]:
# отберем один столбец
bikes['gender']

0          Male
1          Male
2          Male
3          Male
4          Male
          ...
50084      Male
50085      Male
50086      Male
50087    Female
50088      Male
Name: gender, Length: 50089, dtype: object

In [92]:
# извлекаем несколько столбцов, передав
# индексатору [] список
bikes[['gender', 'tripduration']]

       gender  tripduration
0        Male           993
1        Male           623
2        Male          1040
3        Male           667
4        Male           130
...       ...           ...
50084    Male          1625
50085    Male           585
50086    Male           824
50087  Female           178
50088    Male           214

[50089 rows x 2 columns]

In [93]:
# отбираем первые две строки столбцов
# start_capacity и tripduration, передав
# в loc список строк, список столбцов
bikes.loc[[0, 1], ['start_capacity', 'tripduration']]

   start_capacity  tripduration
0            11.0           993
1            31.0           623

In [94]:
# отбираем первые четыре строки столбцов
# с gender по tripduration, передав
# в loc диапазон строк, диапазон столбцов
bikes.loc[0:3, 'gender':'tripduration']

  gender           starttime            stoptime  tripduration
0   Male 2013-06-28 19:01:00 2013-06-28 19:17:00           993
1   Male 2013-06-28 22:53:00 2013-06-28 23:03:00           623
2   Male 2013-06-30 14:43:00 2013-06-30 15:01:00          1040
3   Male 2013-07-01 10:05:00 2013-07-01 10:16:00           667

In [95]:
# отберем каждую 2-ю строку каждого 2-го столбца, 
# передав в loc диапазон строк, диапазон столбцов
bikes.loc[0::2, 'gender':'events':2]

,gender,stoptime,from_station_name,to_station_name,temperature,events
0,Male,2013-06-28 19:17:00,Lake Shore Dr & Monroe St,Michigan Ave & Oak St,73.9,mostlycloudy
2,Male,2013-06-30 15:01:00,Sheffield Ave & Kingsbury St,Dearborn St & Monroe St,73.0,mostlycloudy
4,Male,2013-07-01 11:18:00,Damen Ave & Pierce Ave,Damen Ave & Pierce Ave,73.0,partlycloudy
6,Male,2013-07-02 17:56:00,Clark St & Randolph St,Ravenswood Ave & Irving Park Rd,66.0,cloudy
8,Male,2013-07-03 15:42:00,Clinton St & Washington Blvd,Wood St & Division St,71.1,cloudy
...,...,...,...,...,...,...
50080,Male,2017-12-29 15:51:00,Cityfront Plaza Dr & Pioneer Ct,Mies van der Rohe Way & Chestnut St,14.0,snow
50082,Male,2017-12-30 10:53:00,Larrabee St & Oak St,Halsted St & Blackhawk St (*),3.9,mostlycloudy
50084,Male,2017-12-30 13:34:00,State St & Pearson St,Clark St & Elm St,5.0,partlycloudy
50086,Male,2017-12-30 13:48:00,Kingsbury St & Kinzie St,Halsted St & Blackhawk St (*),5.0,partlycloudy
50088,Male,2017-12-31 15:26:00,Clarendon Ave & Leland Ave,Clifton Ave & Lawrence Ave,10.9,partlycloudy

In [96]:
# а можно было так
bikes.loc[0:50088:2, 'gender':'events':2]

,gender,stoptime,from_station_name,to_station_name,temperature,events
0,Male,2013-06-28 19:17:00,Lake Shore Dr & Monroe St,Michigan Ave & Oak St,73.9,mostlycloudy
2,Male,2013-06-30 15:01:00,Sheffield Ave & Kingsbury St,Dearborn St & Monroe St,73.0,mostlycloudy
4,Male,2013-07-01 11:18:00,Damen Ave & Pierce Ave,Damen Ave & Pierce Ave,73.0,partlycloudy
6,Male,2013-07-02 17:56:00,Clark St & Randolph St,Ravenswood Ave & Irving Park Rd,66.0,cloudy
8,Male,2013-07-03 15:42:00,Clinton St & Washington Blvd,Wood St & Division St,71.1,cloudy
...,...,...,...,...,...,...
50080,Male,2017-12-29 15:51:00,Cityfront Plaza Dr & Pioneer Ct,Mies van der Rohe Way & Chestnut St,14.0,snow
50082,Male,2017-12-30 10:53:00,Larrabee St & Oak St,Halsted St & Blackhawk St (*),3.9,mostlycloudy
50084,Male,2017-12-30 13:34:00,State St & Pearson St,Clark St & Elm St,5.0,partlycloudy
50086,Male,2017-12-30 13:48:00,Kingsbury St & Kinzie St,Halsted St & Blackhawk St (*),5.0,partlycloudy
50088,Male,2017-12-31 15:26:00,Clarendon Ave & Leland Ave,Clifton Ave & Lawrence Ave,10.9,partlycloudy

In [97]:
# отбираем, начиная с пятой строки и столбца 
# from_station_name, передав в loc диапазон 
# строк, диапазон столбцов
bikes.loc[4:, 'from_station_name':]

,from_station_name,start_capacity,to_station_name,end_capacity,temperature,wind_speed,events
4,Damen Ave & Pierce Ave,19.0,Damen Ave & Pierce Ave,19.0,73.0,17.3,partlycloudy
5,California Ave & 21st St,15.0,Clark St & Wrightwood Ave,15.0,73.0,17.3,mostlycloudy
6,Clark St & Randolph St,31.0,Ravenswood Ave & Irving Park Rd,19.0,66.0,15.0,cloudy
7,State St & Van Buren St,27.0,Franklin St & Jackson Blvd,27.0,64.0,5.8,cloudy
8,Clinton St & Washington Blvd,31.0,Wood St & Division St,15.0,71.1,0.0,cloudy
...,...,...,...,...,...,...,...
50084,State St & Pearson St,27.0,Clark St & Elm St,27.0,5.0,16.1,partlycloudy
50085,Halsted St & 35th St (*),16.0,Union Ave & Root St,11.0,5.0,16.1,partlycloudy
50086,Kingsbury St & Kinzie St,31.0,Halsted St & Blackhawk St (*),20.0,5.0,16.1,partlycloudy
50087,Clinton St & Lake St,23.0,Kingsbury St & Kinzie St,31.0,7.0,11.5,partlycloudy
50088,Clarendon Ave & Leland Ave,15.0,Clifton Ave & Lawrence Ave,15.0,10.9,15.0,partlycloudy

In [98]:
# отбираем столбцы start_capacity 
# и tripduration, передав в loc список 
# столбцов после двоеточия с запятой
bikes.loc[:, ['start_capacity', 'tripduration']]

       start_capacity  tripduration
0                11.0           993
1                31.0           623
2                15.0          1040
3                19.0           667
4                19.0           130
...               ...           ...
50084            27.0          1625
50085            16.0           585
50086            31.0           824
50087            23.0           178
50088            15.0           214

[50089 rows x 2 columns]

In [99]:
# отбираем диапазон столбцов с помощью loc
bikes.loc[:, 'gender':'tripduration']

       gender           starttime            stoptime  tripduration
0        Male 2013-06-28 19:01:00 2013-06-28 19:17:00           993
1        Male 2013-06-28 22:53:00 2013-06-28 23:03:00           623
2        Male 2013-06-30 14:43:00 2013-06-30 15:01:00          1040
3        Male 2013-07-01 10:05:00 2013-07-01 10:16:00           667
4        Male 2013-07-01 11:16:00 2013-07-01 11:18:00           130
...       ...                 ...                 ...           ...
50084    Male 2017-12-30 13:07:00 2017-12-30 13:34:00          1625
50085    Male 2017-12-30 13:34:00 2017-12-30 13:44:00           585
50086    Male 2017-12-30 13:34:00 2017-12-30 13:48:00           824
50087  Female 2017-12-31 09:30:00 2017-12-31 09:33:00           178
50088    Male 2017-12-31 15:22:00 2017-12-31 15:26:00           214

[50089 rows x 4 columns]

In [100]:
# отберем строки с метками индекса 1, 5 и 6
bikes.loc[[1, 5, 6], :]

,gender,starttime,stoptime,tripduration,from_station_name,start_capacity,to_station_name,end_capacity,temperature,wind_speed,events
1,Male,2013-06-28 22:53:00,2013-06-28 23:03:00,623,Clinton St & Washington Blvd,31.0,Wells St & Walton St,19.0,69.1,6.9,partlycloudy
5,Male,2013-07-01 12:37:00,2013-07-01 12:48:00,660,California Ave & 21st St,15.0,Clark St & Wrightwood Ave,15.0,73.0,17.3,mostlycloudy
6,Male,2013-07-02 17:47:00,2013-07-02 17:56:00,565,Clark St & Randolph St,31.0,Ravenswood Ave & Irving Park Rd,19.0,66.0,15.0,cloudy

In [101]:
# отберем каждую 10-ю строку
bikes.loc[0::10, :]

,gender,starttime,stoptime,tripduration,from_station_name,start_capacity,to_station_name,end_capacity,temperature,wind_speed,events
0,Male,2013-06-28 19:01:00,2013-06-28 19:17:00,993,Lake Shore Dr & Monroe St,11.0,Michigan Ave & Oak St,15.0,73.9,12.7,mostlycloudy
10,Male,2013-07-04 17:17:00,2013-07-04 17:42:00,1523,Morgan St & 18th St,15.0,Damen Ave & Pierce Ave,19.0,79.0,9.2,mostlycloudy
20,Female,2013-07-09 17:39:00,2013-07-09 17:55:00,943,State St & Van Buren St,27.0,State St & 16th St,15.0,82.9,9.2,mostlycloudy
30,Male,2013-07-12 12:32:00,2013-07-12 12:41:00,512,Jefferson St & Monroe St,19.0,Morgan St & Lake St,15.0,81.0,4.6,partlycloudy
40,Female,2013-07-14 14:08:00,2013-07-14 15:53:00,6274,Wabash Ave & Roosevelt Rd,19.0,Lake Shore Dr & Monroe St,11.0,87.1,8.1,partlycloudy
...,...,...,...,...,...,...,...,...,...,...,...
50040,Male,2017-12-22 11:11:00,2017-12-22 11:27:00,961,Ada St & Washington Blvd,15.0,Dearborn St & Adams St,19.0,39.0,4.6,cloudy
50050,Male,2017-12-22 16:33:00,2017-12-22 16:45:00,708,Lincoln Ave & Roscoe St,19.0,Damen Ave & Charleston St,11.0,37.0,6.9,hazy
50060,Male,2017-12-23 15:31:00,2017-12-23 15:38:00,412,Western Ave & Winnebago Ave,15.0,Spaulding Ave & Armitage Ave,15.0,26.1,11.5,partlycloudy
50070,Male,2017-12-27 20:02:00,2017-12-27 20:06:00,275,Halsted St & Roscoe St,15.0,Clark St & Wellington Ave,15.0,1.0,0.0,partlycloudy
50080,Male,2017-12-29 15:28:00,2017-12-29 15:51:00,1378,Cityfront Plaza Dr & Pioneer Ct,23.0,Mies van der Rohe Way & Chestnut St,19.0,14.0,6.9,snow

In [102]:
# отбираем строки с индексами 2 и 3
# и столбцы с индексами 2 и 3
bikes.iloc[2:4, 2:4]

             stoptime  tripduration
2 2013-06-30 15:01:00          1040
3 2013-07-01 10:16:00           667

In [103]:
# отбираем столбцы с индексами 3 и 5, передав в
# iloc список столбцов после двоеточия с запятой
bikes.iloc[:, [3, 5]]

       tripduration  start_capacity
0               993            11.0
1               623            31.0
2              1040            15.0
3               667            19.0
4               130            19.0
...             ...             ...
50084          1625            27.0
50085           585            16.0
50086           824            31.0
50087           178            23.0
50088           214            15.0

[50089 rows x 2 columns]

In [104]:
# отбираем строки с индексами 3 и 5, передав в
# iloc список строк перед запятой с двоеточием
bikes.iloc[[3, 5], :]

,gender,starttime,stoptime,tripduration,from_station_name,start_capacity,to_station_name,end_capacity,temperature,wind_speed,events
3,Male,2013-07-01 10:05:00,2013-07-01 10:16:00,667,Carpenter St & Huron St,19.0,Clark St & Randolph St,31.0,72.0,16.1,mostlycloudy
5,Male,2013-07-01 12:37:00,2013-07-01 12:48:00,660,California Ave & 21st St,15.0,Clark St & Wrightwood Ave,15.0,73.0,17.3,mostlycloudy

In [105]:
# отбираем строку с меткой индекса 3 и
# столбец tripduration
bikes.at[3, 'tripduration']

667

In [106]:
# отбираем строку с индексом 3 и
# столбец с индексом 3
bikes.iat[3, 3]

667

In [107]:
# отбор по одному условию
filt = bikes['tripduration'] > 5000
bikes[filt].head(3)

,gender,starttime,stoptime,tripduration,from_station_name,start_capacity,to_station_name,end_capacity,temperature,wind_speed,events
18,Male,2013-07-09 13:12:00,2013-07-09 14:42:00,5396,Canal St & Jackson Blvd,35.0,Millennium Park,35.0,79.0,13.8,cloudy
40,Female,2013-07-14 14:08:00,2013-07-14 15:53:00,6274,Wabash Ave & Roosevelt Rd,19.0,Lake Shore Dr & Monroe St,11.0,87.1,8.1,partlycloudy
77,Female,2013-07-21 11:35:00,2013-07-21 13:54:00,8299,State St & 19th St,15.0,Sheffield Ave & Kingsbury St,15.0,82.9,5.8,mostlycloudy

In [108]:
# отбор по нескольким условиям
filt1 = bikes['tripduration'] > 5000
filt2 = bikes['gender'] == 'Female'
filt = filt1 & filt2
bikes[filt].head(3)

,gender,starttime,stoptime,tripduration,from_station_name,start_capacity,to_station_name,end_capacity,temperature,wind_speed,events
40,Female,2013-07-14 14:08:00,2013-07-14 15:53:00,6274,Wabash Ave & Roosevelt Rd,19.0,Lake Shore Dr & Monroe St,11.0,87.1,8.1,partlycloudy
77,Female,2013-07-21 11:35:00,2013-07-21 13:54:00,8299,State St & 19th St,15.0,Sheffield Ave & Kingsbury St,15.0,82.9,5.8,mostlycloudy
1954,Female,2013-12-28 11:37:00,2013-12-28 13:34:00,7050,LaSalle St & Washington St,15.0,Theater on the Lake,15.0,44.1,12.7,clear

In [109]:
# только одно из условий является истинным
filt = filt1 | filt2
bikes[filt].head(3)

,gender,starttime,stoptime,tripduration,from_station_name,start_capacity,to_station_name,end_capacity,temperature,wind_speed,events
9,Female,2013-07-04 15:00:00,2013-07-04 15:16:00,922,Lakeview Ave & Fullerton Pkwy,19.0,Racine Ave & Congress Pkwy,19.0,81.0,12.7,mostlycloudy
14,Female,2013-07-06 12:39:00,2013-07-06 12:49:00,610,Morgan St & Lake St,15.0,Aberdeen St & Jackson Blvd,15.0,82.0,5.8,mostlycloudy
18,Male,2013-07-09 13:12:00,2013-07-09 14:42:00,5396,Canal St & Jackson Blvd,35.0,Millennium Park,35.0,79.0,13.8,cloudy

In [110]:
# несколько условий в одном столбце events
filt = ((bikes['events'] == 'rain') |
        (bikes['events'] == 'snow') |
        (bikes['events'] == 'tstorms') |
        (bikes['events'] == 'sleet'))
bikes[filt].head(3)

,gender,starttime,stoptime,tripduration,from_station_name,start_capacity,to_station_name,end_capacity,temperature,wind_speed,events
45,Male,2013-07-15 16:43:00,2013-07-15 16:55:00,727,Greenwood Ave & 47th St,15.0,State St & Harrison St,19.0,82.9,5.8,rain
78,Male,2013-07-21 16:35:00,2013-07-21 17:06:00,1809,Michigan Ave & Pearson St,23.0,Millennium Park,35.0,82.4,11.5,tstorms
79,Male,2013-07-21 16:47:00,2013-07-21 17:03:00,999,Carpenter St & Huron St,19.0,Carpenter St & Huron St,19.0,82.4,11.5,tstorms

In [111]:
# несколько условий в одном столбце events,
# используем isin
filt = bikes['events'].isin(['rain', 'snow', 
                             'tstorms', 'sleet'])
bikes[filt].head(3)

,gender,starttime,stoptime,tripduration,from_station_name,start_capacity,to_station_name,end_capacity,temperature,wind_speed,events
45,Male,2013-07-15 16:43:00,2013-07-15 16:55:00,727,Greenwood Ave & 47th St,15.0,State St & Harrison St,19.0,82.9,5.8,rain
78,Male,2013-07-21 16:35:00,2013-07-21 17:06:00,1809,Michigan Ave & Pearson St,23.0,Millennium Park,35.0,82.4,11.5,tstorms
79,Male,2013-07-21 16:47:00,2013-07-21 17:03:00,999,Carpenter St & Huron St,19.0,Carpenter St & Huron St,19.0,82.4,11.5,tstorms

In [112]:
# сочетание isin и дополнительного фильтра
filt1 = bikes['events'].isin(['rain', 'snow', 
                              'tstorms', 'sleet'])
filt2 = bikes['tripduration'] > 2000
filt = filt1 & filt2
bikes[filt].head(3)

,gender,starttime,stoptime,tripduration,from_station_name,start_capacity,to_station_name,end_capacity,temperature,wind_speed,events
2344,Female,2014-03-19 07:23:00,2014-03-19 08:00:00,2181,Seeley Ave & Roscoe St,11.0,Franklin St & Lake St,23.0,43.0,6.9,rain
7697,Male,2014-09-12 14:20:00,2014-09-12 14:57:00,2213,Damen Ave & Pierce Ave,19.0,California Ave & Division St,15.0,52.0,12.7,rain
8357,Male,2014-09-30 08:21:00,2014-09-30 08:58:00,2246,Damen Ave & Melrose Ave,11.0,Wood St & Taylor St,15.0,46.9,11.5,rain

In [113]:
# отбор по одному условию
bikes.query('tripduration > 5000').head(3)

,gender,starttime,stoptime,tripduration,from_station_name,start_capacity,to_station_name,end_capacity,temperature,wind_speed,events
18,Male,2013-07-09 13:12:00,2013-07-09 14:42:00,5396,Canal St & Jackson Blvd,35.0,Millennium Park,35.0,79.0,13.8,cloudy
40,Female,2013-07-14 14:08:00,2013-07-14 15:53:00,6274,Wabash Ave & Roosevelt Rd,19.0,Lake Shore Dr & Monroe St,11.0,87.1,8.1,partlycloudy
77,Female,2013-07-21 11:35:00,2013-07-21 13:54:00,8299,State St & 19th St,15.0,Sheffield Ave & Kingsbury St,15.0,82.9,5.8,mostlycloudy

In [114]:
# отбор по нескольким условиям
bikes.query('tripduration > 5000 and gender=="Female"').head(3)

,gender,starttime,stoptime,tripduration,from_station_name,start_capacity,to_station_name,end_capacity,temperature,wind_speed,events
40,Female,2013-07-14 14:08:00,2013-07-14 15:53:00,6274,Wabash Ave & Roosevelt Rd,19.0,Lake Shore Dr & Monroe St,11.0,87.1,8.1,partlycloudy
77,Female,2013-07-21 11:35:00,2013-07-21 13:54:00,8299,State St & 19th St,15.0,Sheffield Ave & Kingsbury St,15.0,82.9,5.8,mostlycloudy
1954,Female,2013-12-28 11:37:00,2013-12-28 13:34:00,7050,LaSalle St & Washington St,15.0,Theater on the Lake,15.0,44.1,12.7,clear

In [115]:
# только одно из условий является истинным
bikes.query('tripduration > 5000 or gender=="Female"').head(3)

,gender,starttime,stoptime,tripduration,from_station_name,start_capacity,to_station_name,end_capacity,temperature,wind_speed,events
9,Female,2013-07-04 15:00:00,2013-07-04 15:16:00,922,Lakeview Ave & Fullerton Pkwy,19.0,Racine Ave & Congress Pkwy,19.0,81.0,12.7,mostlycloudy
14,Female,2013-07-06 12:39:00,2013-07-06 12:49:00,610,Morgan St & Lake St,15.0,Aberdeen St & Jackson Blvd,15.0,82.0,5.8,mostlycloudy
18,Male,2013-07-09 13:12:00,2013-07-09 14:42:00,5396,Canal St & Jackson Blvd,35.0,Millennium Park,35.0,79.0,13.8,cloudy

In [116]:
# отбор с помощью слова in
bikes.query('events in ["snow", "rain"]').head(3)

,gender,starttime,stoptime,tripduration,from_station_name,start_capacity,to_station_name,end_capacity,temperature,wind_speed,events
45,Male,2013-07-15 16:43:00,2013-07-15 16:55:00,727,Greenwood Ave & 47th St,15.0,State St & Harrison St,19.0,82.9,5.8,rain
112,Male,2013-07-26 19:10:00,2013-07-26 19:33:00,1395,Larrabee St & Kingsbury St,27.0,Damen Ave & Pierce Ave,19.0,66.9,12.7,rain
124,Male,2013-07-30 18:53:00,2013-07-30 19:00:00,442,Canal St & Jackson Blvd,35.0,Racine Ave & Congress Pkwy,19.0,69.1,3.5,rain

In [117]:
# отбор с помощью слова not in
bikes.query('events not in ["cloudy", "partlycloudy", "mostlycloudy"]').head(3)

,gender,starttime,stoptime,tripduration,from_station_name,start_capacity,to_station_name,end_capacity,temperature,wind_speed,events
25,Female,2013-07-11 08:17:00,2013-07-11 08:31:00,830,Wabash Ave & Roosevelt Rd,19.0,Daley Center Plaza,47.0,73.9,8.1,clear
26,Male,2013-07-12 01:07:00,2013-07-12 01:24:00,1043,State St & Harrison St,19.0,Racine Ave & 18th St,15.0,64.9,0.0,clear
33,Male,2013-07-12 17:22:00,2013-07-12 17:34:00,730,Clark St & Congress Pkwy,27.0,Racine Ave & Congress Pkwy,19.0,79.0,10.4,clear

In [118]:
# отберем три столбца для поездок, совершенные,
# когда шел снег или дождь
cols = ['starttime', 'temperature', 'events']
bikes.query('events in ["snow", "rain"]')[cols].head(3)

              starttime  temperature events
45  2013-07-15 16:43:00         82.9   rain
112 2013-07-26 19:10:00         66.9   rain
124 2013-07-30 18:53:00         69.1   rain

In [119]:
# вычислим среднюю длительность поездки 
# в зависимости от погоды во время поездки
bikes.groupby('events').agg(
    avg_tripduration=('tripduration', 'mean'))

              avg_tripduration
events
clear               767.718240
cloudy              690.291346
fog                 570.557377
hazy                691.301724
mostlycloudy        736.609963
partlycloudy        725.389928
rain                633.748906
sleet               541.250000
snow                592.860515
tstorms             636.160377
unknown             635.750000

In [120]:
# вычислим среднюю длительность поездки 
# в зависимости от комбинации пола 
# и погоды во время поездки
bikes.groupby(['gender', 'events']).agg(
    avg_tripduration=('tripduration', 'mean'))

                     avg_tripduration
gender events
Female clear               889.229955
       cloudy              764.428671
       fog                 698.933333
       hazy                797.823529
       mostlycloudy        819.058638
       partlycloudy        839.990322
       rain                646.034568
       sleet               781.333333
       snow                613.750000
       tstorms             709.925000
       unknown             240.000000
Male   clear               730.481688
       cloudy              667.281823
       fog                 528.695652
       hazy                656.874525
       mostlycloudy        708.844771
       partlycloudy        684.834807
       rain                630.252284
       sleet               485.846154
       snow                589.534826
       tstorms             611.365546
       unknown             767.666667

In [121]:
# вычислим среднюю длительность поездки в зависимости
# от комбинации пола и погоды во время поездки,
# избавимся от многоуровневого индекса
bikes.groupby(['gender', 'events']).agg(
    avg_tripduration=('tripduration', 'mean')).reset_index()

    gender        events  avg_tripduration
0   Female         clear        889.229955
1   Female        cloudy        764.428671
2   Female           fog        698.933333
3   Female          hazy        797.823529
4   Female  mostlycloudy        819.058638
5   Female  partlycloudy        839.990322
6   Female          rain        646.034568
7   Female         sleet        781.333333
8   Female          snow        613.750000
9   Female       tstorms        709.925000
10  Female       unknown        240.000000
11    Male         clear        730.481688
12    Male        cloudy        667.281823
13    Male           fog        528.695652
14    Male          hazy        656.874525
15    Male  mostlycloudy        708.844771
16    Male  partlycloudy        684.834807
17    Male          rain        630.252284
18    Male         sleet        485.846154
19    Male          snow        589.534826
20    Male       tstorms        611.365546
21    Male       unknown        767.666667

In [122]:
# мы вычислим среднюю продолжительность поездки 
# и среднюю температуру для каждого типа
# погодного явления,  избавимся от
# многоуровневого индекса
bikes.groupby('events').agg(
    avg_tripduration=('tripduration', 'mean'),
    avg_temp=('temperature', 'mean')).reset_index()

          events  avg_tripduration     avg_temp
0          clear        767.718240    59.531476
1         cloudy        690.291346    56.621143
2            fog        570.557377    50.235246
3           hazy        691.301724    55.594253
4   mostlycloudy        736.609963    67.278551
5   partlycloudy        725.389928    65.444558
6           rain        633.748906    57.066247
7          sleet        541.250000    31.243750
8           snow        592.860515    26.654506
9        tstorms        636.160377    74.200943
10       unknown        635.750000 -2462.250000

In [123]:
# вычислим среднюю длительность поездки,
# максимальную длительность поездки, среднюю температуру
# в зависимости типа погоды во время поездки,
# избавимся от многоуровневого индекса
bikes.groupby('events').agg(
    avg_tripduration=('tripduration', 'mean'),
    max_tripduration=('tripduration', 'max'),
    avg_temp=('temperature', 'mean')).reset_index()

          events  avg_tripduration  max_tripduration     avg_temp
0          clear        767.718240             73591    59.531476
1         cloudy        690.291346             86188    56.621143
2            fog        570.557377              1776    50.235246
3           hazy        691.301724              7739    55.594253
4   mostlycloudy        736.609963             63155    67.278551
5   partlycloudy        725.389928             85442    65.444558
6           rain        633.748906             28994    57.066247
7          sleet        541.250000              1257    31.243750
8           snow        592.860515              8309    26.654506
9        tstorms        636.160377              2868    74.200943
10       unknown        635.750000              1325 -2462.250000

In [124]:
# загружаем данные
ins = pd.read_csv('Data/StateFarm_missing.csv', sep=';')
ins.head()

,Customer Lifetime Value,Coverage,Education,EmploymentStatus,Gender,Income,Monthly Premium Auto,Months Since Last Claim,Months Since Policy Inception,Number of Open Complaints,Number of Policies,Response
0,2763.519279,Basic,Bachelor,Employed,F,56274.0,NaN,32.0,5.0,NaN,1.0,No
1,NaN,NaN,Bachelor,Unemployed,F,0.0,NaN,13.0,42.0,NaN,NaN,No
2,NaN,NaN,NaN,Employed,F,48767.0,108.0,NaN,38.0,0.0,NaN,No
3,7645.861827,Basic,Bachelor,NaN,NaN,0.0,106.0,18.0,NaN,NaN,7.0,No
4,2813.692575,Basic,Bachelor,NaN,M,43836.0,73.0,12.0,NaN,NaN,1.0,No

In [125]:
# смотрим, как варьирует средний доход клиента 
# по комбинациям пола и образования
ins.pivot_table(index='Education', 
                columns='Gender', 
                values='Income', 
                aggfunc='mean')

Gender                           F             M
Education
Bachelor              37972.366023  37040.250000
College               37740.598055  36781.846543
Doctor                45731.160256  39342.279503
High School or Below  36211.804149  35891.237416
Master                44329.254190  45259.220000

In [126]:
# смотрим, как варьирует средний доход клиента 
# по комбинациям пола и образования,
# округлим и превратим в целые числа
ins.pivot_table(
    index='Education', 
    columns='Gender', 
    values='Income',
    aggfunc='mean').round(-3).astype('int')

Gender                    F      M
Education
Bachelor              38000  37000
College               38000  37000
Doctor                46000  39000
High School or Below  36000  36000
Master                44000  45000

In [127]:
# все то же самое можно получить, используя
# агрегацию с groupby
ins.groupby(['Gender', 'Education']).agg(
    mean_salary=('Income', 'mean')) \
   .round(-3).astype('int64')

                             mean_salary
Gender Education
F      Bachelor                    38000
       College                     38000
       Doctor                      46000
       High School or Below        36000
       Master                      44000
M      Bachelor                    37000
       College                     37000
       Doctor                      39000
       High School or Below        36000
       Master                      45000

In [128]:
# смотрим максимальный доход клиента 
# по комбинациям пола и образования
ins.pivot_table(index='Education', 
                columns='Gender', 
                values='Income', 
                aggfunc='max')

Gender                      F        M
Education
Bachelor              99803.0  99981.0
College               99961.0  99816.0
Doctor                98912.0  99443.0
High School or Below  99841.0  99874.0
Master                99875.0  99960.0

In [129]:
# смотрим максимальный доход клиента 
# по комбинациям пола и образования,
# поменяли Education и Gender местами
ins.pivot_table(index='Gender', 
                columns='Education', 
                values='Income', 
                aggfunc='max')

Education  Bachelor  College   Doctor  High School or Below   Master
Gender
F           99803.0  99961.0  98912.0               99841.0  99875.0
M           99981.0  99816.0  99443.0               99874.0  99960.0

In [130]:
# посмотрим среднюю пожизненную ценность клиента 
# по комбинациям типа занятости и образования,
# результаты переводим в целые числа
emp_edu_mean_clv = ins.pivot_table(
    index='EmploymentStatus', 
    columns='Education', 
    values='Customer Lifetime Value', 
    aggfunc='mean').astype('int64')
emp_edu_mean_clv

Education         Bachelor  College  Doctor  High School or Below  Master
EmploymentStatus
Disabled              6729     6756    7272                  9983    7964
Employed              8224     8047    7538                  8566    8042
Medical Leave         7708     6952   11690                  8235    7834
Retired               7846     7051    4518                  5860   12442
Unemployed            7103     7681    6966                  7739    8807

In [131]:
# подсветим максимальные значения в каждом столбце
emp_edu_mean_clv.style.highlight_max()

In [132]:
# подсветим максимальные значения в каждой строке
emp_edu_mean_clv.style.highlight_max(axis='columns')

In [133]:
# задаем интенсивность фона ячейки 
# в зависимости от значения в ячейке
emp_edu_mean_clv.style.background_gradient(cmap='Oranges')

In [134]:
# подсветим минимальные и максимальные 
# значения в каждом столбце
emp_edu_mean_clv.style.highlight_max(color='yellow') \
                      .highlight_min(color='lightblue')

In [135]:
# вычислим размер каждой уникальной комбинации 
# типа занятости и образования
ins.pivot_table(index='EmploymentStatus', 
                columns='Education', 
                aggfunc='size')

Education         Bachelor  College  Doctor  High School or Below  Master
EmploymentStatus
Disabled               114       83      21                   107      37
Employed              1553     1499     230                  1412     492
Medical Leave          113      133      15                   106      25
Retired                 79       91       1                    62      19
Unemployed             635      614      50                   710      86

In [136]:
# смотрим, как варьирует средний доход клиента 
# по комбинациям типа занятости и образования,
# добавляем среднюю зарплату для
# всей строки и всего столбца
ins.pivot_table(index='EmploymentStatus', 
                columns='Education', 
                values='Income', 
                aggfunc='mean',
                margins=True)

Education,Bachelor,College,Doctor,High School or Below,Master,All
EmploymentStatus,,,,,,
Disabled,19981.508772,20604.397590,20397.904762,19145.635514,21065.675676,20012.226519
Employed,56272.710238,55899.775851,55413.704348,57315.307365,56674.939024,56448.846703
Medical Leave,19720.584071,20586.947368,18364.933333,21003.962264,19227.400000,20278.237245
Retired,21276.468354,20543.802198,19186.000000,19570.354839,20025.263158,20489.503968
Unemployed,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
All,37521.522855,37236.148347,42486.334385,36052.390071,44802.223065,37782.136962

In [137]:
# вычислим средний доход
print(ins['Income'].mean())

37785.17199372814

In [138]:
# задаем один группирующий столбец
ins.pivot_table(index='EmploymentStatus', 
                values='Income', 
                aggfunc='mean').round(-3)

                   Income
EmploymentStatus
Disabled          20000.0
Employed          56000.0
Medical Leave     20000.0
Retired           20000.0
Unemployed            0.0

In [139]:
# тот же результат с .groupby()
ins.groupby('EmploymentStatus').agg(
    average_income=('Income', 'mean')).round(-3)

                  average_income
EmploymentStatus
Disabled                 20000.0
Employed                 56000.0
Medical Leave            20000.0
Retired                  20000.0
Unemployed                   0.0

In [140]:
# поворачиваем таблицу с одним столбцом
ins.pivot_table(columns='EmploymentStatus', 
                values='Income', 
                aggfunc='mean').round(-3)

EmploymentStatus  Disabled  Employed  Medical Leave  Retired  Unemployed
Income             20000.0   56000.0        20000.0  20000.0         0.0

In [141]:
# задаем два столбца вертикальной группировки 
# (тип занятости, пол) и один столбец 
# горизонтальной группировки (образование)
ins.pivot_table(index=['EmploymentStatus', 'Gender'], 
                columns='Education',
                values='Income', 
                aggfunc='max')

Education                Bachelor  College   Doctor  High School or Below  \
EmploymentStatus Gender
Disabled         F        29633.0  29958.0  29950.0               28672.0
                 M        28898.0  28617.0  29808.0               29295.0
Employed         F        99803.0  99961.0  98912.0               99841.0
                 M        99981.0  99816.0  99443.0               99874.0
Medical Leave    F        29957.0  29539.0  26463.0               29658.0
                 M        29926.0  29723.0  23053.0               29664.0
Retired          F        25859.0  28321.0      NaN               28120.0
                 M        29465.0  29692.0  19186.0               28140.0
Unemployed       F            0.0      0.0      0.0                   0.0
                 M            0.0      0.0      0.0                   0.0

Education                 Master
EmploymentStatus Gender
Disabled         F       29981.0
                 M       28245.0
Employed         F       99875.0
                 M       99960.0
Medical Leave    F       27229.0
                 M       26840.0
Retired          F       26161.0
                 M       24182.0
Unemployed       F           0.0
                 M           0.0

In [142]:
# зададим один столбец вертикальной группировки
# (тип занятости) и два столбца горизонтальной 
# группировки (пол и образование)
ins.pivot_table(index='EmploymentStatus', 
                columns=['Gender', 'Education'],
                values='Income', 
                aggfunc='max')

Gender                  F                                                  \
Education        Bachelor  College   Doctor High School or Below   Master
EmploymentStatus
Disabled          29633.0  29958.0  29950.0              28672.0  29981.0
Employed          99803.0  99961.0  98912.0              99841.0  99875.0
Medical Leave     29957.0  29539.0  26463.0              29658.0  27229.0
Retired           25859.0  28321.0      NaN              28120.0  26161.0
Unemployed            0.0      0.0      0.0                  0.0      0.0

Gender                  M
Education        Bachelor  College   Doctor High School or Below   Master
EmploymentStatus
Disabled          28898.0  28617.0  29808.0              29295.0  28245.0
Employed          99981.0  99816.0  99443.0              99874.0  99960.0
Medical Leave     29926.0  29723.0  23053.0              29664.0  26840.0
Retired           29465.0  29692.0  19186.0              28140.0  24182.0
Unemployed            0.0      0.0      0.0                  0.0      0.0

In [143]:
# зададим два агрегируемых столбца 
# (пожизненная ценность клиента и доход)
ins.pivot_table(
    index='Education', 
    columns='Gender',
    values=['Income', 'Customer Lifetime Value'],
    aggfunc='mean', margins=True)

                     Customer Lifetime Value                            \
Gender                                     F            M          All
Education
Bachelor                         7980.275871  7675.774393  7833.763532
College                          7757.306941  7868.564624  7811.832401
Doctor                           7530.432422  7702.351623  7617.747852
High School or Below             8504.800424  8093.913831  8300.471338
Master                           8457.905556  8015.928886  8256.396436
All                              8088.051778  7882.111780  7987.666592

                            Income
Gender                           F             M           All
Education
Bachelor              37972.366023  37040.250000  37539.099439
College               37740.598055  36781.846543  37270.730579
Doctor                45731.160256  39342.279503  42486.334385
High School or Below  36211.804149  35891.237416  36052.390071
Master                44329.254190  45259.220000  44753.250760
All                   38235.288439  37327.506313  37792.791214

In [144]:
# зададим несколько агрегирующих функций
ins.pivot_table(
    index='Education', 
    columns='Gender',
    values='Income',
    aggfunc=['min', 'mean', 'max'], margins=True)

                      min                    mean                              \
Gender                  F    M  All             F             M           All
Education
Bachelor              0.0  0.0  0.0  37972.366023  37040.250000  37524.053707
College               0.0  0.0  0.0  37740.598055  36781.846543  37270.730579
Doctor                0.0  0.0  0.0  45731.160256  39342.279503  42486.334385
High School or Below  0.0  0.0  0.0  36211.804149  35891.237416  36052.390071
Master                0.0  0.0  0.0  44329.254190  45259.220000  44753.250760
All                   0.0  0.0  0.0  38226.287665  37327.506313  37788.230723

                          max
Gender                      F        M      All
Education
Bachelor              99803.0  99981.0  99981.0
College               99961.0  99816.0  99961.0
Doctor                98912.0  99443.0  99443.0
High School or Below  99841.0  99874.0  99874.0
Master                99875.0  99960.0  99960.0
All                   99961.0  99981.0  99981.0

In [145]:
# выведем абсолютные частоты категорий
ins['Coverage'].value_counts(dropna=False)

Basic       5038
Extended    2501
Premium      749
NaN            5
Name: Coverage, dtype: int64

In [146]:
# выведем относительные частоты категорий
ins['Coverage'].value_counts(dropna=False, 
                             normalize=True)

Basic       0.607500
Extended    0.301580
Premium     0.090317
NaN         0.000603
Name: Coverage, dtype: float64

In [147]:
# выведем абсолютные частоты категорий
# с помощью .groupby() и .size()
ins.groupby('Coverage').size().reset_index(name='count')

   Coverage  count
0     Basic   5038
1  Extended   2501
2   Premium    749

In [148]:
# выведем абсолютные частоты категорий
# с помощью .groupby() и .size()
ins.groupby(['Coverage', 'Gender']).size().reset_index(name='count')

   Coverage Gender  count
0     Basic      F   2547
1     Basic      M   2489
2  Extended      F   1308
3  Extended      M   1192
4   Premium      F    392
5   Premium      M    356

In [149]:
# выведем абсолютные частоты категорий
# с помощью .pivot_table() 
ins.pivot_table(index='Coverage', 
                columns='Gender', 
                aggfunc='size')

Gender       F     M
Coverage
Basic     2547  2489
Extended  1308  1192
Premium    392   356

In [150]:
# строим таблицу сопряженности вида 
# страхового покрытия и пола
pd.crosstab(index=ins['Coverage'], 
            columns=ins['Gender'])

Gender       F     M
Coverage
Basic     2547  2489
Extended  1308  1192
Premium    392   356

In [151]:
# вычислим относительные частоты мужчин и женщин 
# в каждом виде страхового покрытия,
# нормализация по строкам
pd.crosstab(index=ins['Coverage'],
            columns=ins['Gender'],
            normalize='index').round(3) * 100

Gender       F     M
Coverage
Basic     50.6  49.4
Extended  52.3  47.7
Premium   52.4  47.6

In [152]:
# вычислим относительные частоты видов 
# страхового покрытия для мужчин и женщин,
# нормализация по столбцам
pd.crosstab(index=ins['Coverage'],
            columns=ins['Gender'],
            normalize='columns').round(3) * 100

Gender       F     M
Coverage
Basic     60.0  61.7
Extended  30.8  29.5
Premium    9.2   8.8

In [153]:
# вычислим относительные частоты
# с учетом всех данных
pd.crosstab(index=ins['Coverage'],
            columns=ins['Gender'],
            normalize='all').round(3) * 100

Gender       F     M
Coverage
Basic     30.7  30.0
Extended  15.8  14.4
Premium    4.7   4.3

In [154]:
# вернемся к абсолютным частотам, зададим 
# итоги по строкам и столбцам
pd.crosstab(index=ins['Coverage'], 
            columns=ins['Gender'],
            margins=True)

Gender       F     M   All
Coverage
Basic     2547  2489  5036
Extended  1308  1192  2500
Premium    392   356   748
All       4247  4037  8284